{
  "_id": {
    "$oid": "5e42d7aaa962fe684495958a"
  },
  "name": "Batman vs Superman",
  "description": "It's been nearly two years since Superman's (Henry Cavill) colossal battle with Zod (Michael Shannon) devastated the city of Metropolis. The loss of life and collateral damage left many feeling angry and helpless, including crime-fighting billionaire Bruce Wayne (Ben Affleck). Convinced that Superman is now a threat to humanity, Batman embarks on a personal vendetta to end his reign on Earth, while the conniving Lex Luthor (Jesse Eisenberg) launches his own crusade against the Man of Steel.\n",
  "genre": "Science fiction film/Action fiction",
  "__v": 0,
  "released": "2016",
  "runtime": "3h 3m"
}
{
  "_id": {
    "$oid": "5e42d7e0a962fe684495958b"
  },
  "name": "Logan",
  "description": "In the near future, a weary Logan (Hugh Jackman) cares for an ailing Professor X (Patrick Stewart) at a remote outpost on the Mexican border. His plan to hide from the outside world gets upended when he meets a young mutant (Dafne Keen) who is very much like him. Logan must now protect the girl and battle the dark forces that want to capture her.\n",
  "genre": "Drama/Science fiction film",
  "__v": 0,
  "released": "2017",
  "runtime": "2h 21m"
}
{
  "_id": {
    "$oid": "5e42d831a962fe684495958c"
  },
  "name": "Star Wars: The Last Jedi",
  "description": "Luke Skywalker's peaceful and solitary existence gets upended when he encounters Rey, a young woman who shows strong signs of the Force. Her desire to learn the ways of the Jedi forces Luke to make a decision that changes their lives forever. Meanwhile, Kylo Ren and General Hux lead the First Order in an all-out assault against Leia and the Resistance for supremacy of the galaxy.",
  "genre": "Fantasy/Science fiction film",
  "__v": 0,
  "released": "2017",
  "runtime": "2h 35m"
}
{
  "_id": {
    "$oid": "5e42d863a962fe684495958d"
  },
  "name": "Wonder Woman",
  "description": "Before she was Wonder Woman (Gal Gadot), she was Diana, princess of the Amazons, trained to be an unconquerable warrior. Raised on a sheltered island paradise, Diana meets an American pilot (Chris Pine) who tells her about the massive conflict that's raging in the outside world. Convinced that she can stop the threat, Diana leaves her home for the first time. Fighting alongside men in a war to end all wars, she finally discovers her full powers and true destiny.",
  "genre": "Fantasy/Science fiction film",
  "__v": 0,
  "released": "2017",
  "runtime": "2h 21m"
}
{
  "_id": {
    "$oid": "5e42d895a962fe684495958e"
  },
  "name": "Dunkirk",
  "description": "In May 1940, Germany advanced into France, trapping Allied troops on the beaches of Dunkirk. Under air and ground cover from British and French forces, troops were slowly and methodically evacuated from the beach using every serviceable naval and civilian vessel that could be found. At the end of this heroic mission, 330,000 French, British, Belgian and Dutch soldiers were safely evacuated.",
  "genre": "Drama/Thriller",
  "__v": 0,
  "released": "2017",
  "runtime": "2 hours"
}
{
  "_id": {
    "$oid": "5e42d8c5a962fe684495958f"
  },
  "name": "The Revenant",
  "description": "While exploring the uncharted wilderness in 1823, frontiersman Hugh Glass (Leonardo DiCaprio) sustains life-threatening injuries from a brutal bear attack. When a member (Tom Hardy) of his hunting team kills his young son (Forrest Goodluck) and leaves him for dead, Glass must utilize his survival skills to find a way back to civilization. Grief-stricken and fueled by vengeance, the legendary fur trapper treks through the snowy terrain to track down the man who betrayed him.",
  "genre": "Drama/Thriller",
  "__v": 0,
  "released": "2015",
  "runtime": "2h 36m"
}
{
  "_id": {
    "$oid": "5e528ff58bf77d25ede9174e"
  },
  "name": "1917",
  "description": "April 1917, the Western Front. Two British soldiers are sent to deliver an urgent message to an isolated regiment. If the message is not received in time the regiment will walk into a trap and be massacred. To get to the regiment they will need to cross through enemy territory. Time is of the essence and the journey will be fraught with danger. ",
  "released": "2020",
  "genre": " Drama/War",
  "runtime": "1h 59min",
  "__v": 0
}
{
  "_id": {
    "$oid": "5e5290898bf77d25ede9174f"
  },
  "name": "Bad Boys for Life",
  "description": "Marcus and Mike have to confront new issues (career changes and midlife crises), as they join the newly created elite team AMMO of the Miami police department to take down the ruthless Armando Armas, the vicious leader of a Miami drug cartel.",
  "released": "2020",
  "genre": " Action/Comedy/Crime/Thriller",
  "runtime": "2h 4min",
  "__v": 0
}